"OK" = "OK";
"Відміна" = "Cancel";
"Закрити" = "Close";
"Обрати" = "Choose";
"Так" = "Yes";
"Ні" = "No";
"Підключитися" = "Connect";
"Зчитати" = "Read";
"Знищити" = "Destroy";
"Записати" = "Write";
"Допомога" = "Help";
"Застосувати" = "Apply";
"Змінити" = "Change";
"Назад" = "Back";
"Далі" = "Next";
"Інформація" = "Info";
"Переглянути" = "View";
"Імпортувати" = "Import";
"Експортувати" = "Export";
"Перевірити" = "Check";
"Видалити" = "Delete";
"Всі" = "All";
"Жодного" = "None";
"Переглянути сертифікат" = "Show certificate";
"Переглянути сертифікати" = "Show certificates";
"Переглянути СВС" = "Show CRLs";
"З сертифіката" = "From certificate";
"Згенерувати" = "Generate";
"Резервне копіювання" = "Backup";
"Поновити" = "Update";
"Додати" = "Add";
"Змінити" = "Change";
"Видалити" = "Delete";
"Друкувати" = "Print";
"Зберегти у текстовий файл" = "Save to text file";
"\U0000276E Назад" = "\U0000276E Back";
"Змінити пароль захисту" = "Change password";
"Змінити список" = "Change list";
"Мережних криптомодулів \"Гряда-301\"" = "Network cryptomodules \"Gryada-301\"";
"Сертифікати" = "Certificates";
"Списки відкликаних сертифікатів" = "Certificates revocation lists";
"Пошук та визначення статусу сертифіката" = "Certificate search and check status";
"Пошук та визначення статусу сертифікатів" = "Certificates search and check status";
"Параметри роботи" = "Parameters";
"Генерація ключів" = "Generate keys";
"Запит на формування сертифіката з відкритим ключем ЕЦП" = "Request for make certificate with public key for DS";
"Запит на формування сертифіката з відкритим ключем протоколу розподілу" = "Request for make certificate with public key for KEP";
"Запит на формування сертифіката з відкритим ключем RSA" = "Request for make certificate with public key for RSA";
"Запит на формування сертифіката з відкритим ключем ECDSA" = "Request for make certificate with public key for ECDSA";
"Підключення до proxy-сервера" = "Connect to proxy-server";
"Зчитування особистого ключа" = "Read private key";
"Параметри носія ключової інформації" = "Key media parameters";
"Знищення особистого ключа" = "Destroy private key";
"Зміна пароля доступу" = "Change private key password";
"Запис особистого ключа" = "Write private key";
"Сертифікат" = "Certificate";
"Список відкликаних сертифікатів" = "Certificates revocation list";
"Запит на формування сертифіката" = "Request for make certificate";
"Запит на зміну статусу сертифіката" = "Change certificate status request";
"Підписані та зашифровані дані" = "Signed and encrypted data";
"Зашифровані дані" = "Encrypted data";
"Підписані дані" = "Signed data";
"Захищені дані" = "Protected data";
"Особистий ключ" = "Private key";
"Налаштування точки доступу до OCSP-сервера" = "OCSP-server access point settings";
"Сертифікат CMP-сервера" = "CMP-server certificate";
"Сертифікат CMP-сервера ЦСК" = "CMP-server certificate CA";
"Сертифікат TSP-сервера" = "TSP-server certificate";
"Сертифікат ЦСК" = "CA certificate";
"Сертифікат OCSP-сервера" = "OCSP-server certificate";
"Сертифікат користувача" = "User certificate";
"Інформація оператору" = "Information to operator";
"Точка доступу до сервера" = "Server access point";
"Власний сертифікат" = "Own certificate";
"Сертифікати користувачів-отримувачів" = "Recipients users certificates";
"Облікові дані" = "Credentials";
"Експорт ключів" = "Keys export";
"Мережні криптомодулі \"Гряда-301\"" = "Network cryptomodules \"Gryada-301\"";
"DNS-ім'я чи ІР-адреса сервера" = "Server DNS-name or IP-address";
"TCP-порт" = "TCP-port";
"Тип" = "Type";
"Назва" = "Name";
"Користувач" = "User";
"Ім'я користувача" = "User name";
"Пароль" = "Password";
"Детальна інформація" = "Detailed info";
"Загальна інформація" = "Common info";
"Інформація" = "Information";
"Ім’я файлу" = "File name";
"Час друку" = "Print time";
"Час запису" = "Save time";
"Відстуня" = "Not available";
"Ім'я власника" = "Owner name";
"Загальна кількість сертифікатів: %i" = "Total certificates: %i";
"Типи власників" = "Owners types";
"Всі" = "All";
"Центри сертифікації ключів (ЦСК)" = "Certificate Authorities (CA)";
"Сервери ЦСК" = "CA Servers";
"CMP-сервери" = "CMP Servers";
"OCSP-сервери" = "OCSP Servers";
"TSP-сервери" = "TSP Servers";
"Користувачі ЦСК" = "Users";
"Адміністратори реєстрації" = "Registration Administrators";
"Загальна кількість СВС: %i" = "Total CRLs: %i";
"Сертифікати" = "Certificates";
"СВС" = "CRL";
"Результати пошуку та визначення статусу" = "Results and status determination";
"Інформація про сертифікат" = "Certificate information";
"Файлове сховище сертифікатів та СВС" = "Certificates and CRLs filestore";
"Параметри файлового сховища" = "Filestore parameters";
"Каталог з сертифікатами та СВС" = "Directory with certificates and CRLs";
"Автоматично перечитувати при виявленні змін" = "Automatic refresh on changes";
"Зберігати сертифікати, що отримані з OCSP-, LDAP- чи CMP-серверів" = "Save certificates downloaded from OCSP-, LDAP- or CMP-servers";
"Час зберігання стану перевіреного сертифіката, с:" = "Check certificate status save time, s:";
"Перевіряти СВС" = "Check CRLs";
"Тільки свого ЦСК" = "Only own CA";
"Завантажувати автоматично" = "Download automatically";
"Повний та частковий" = "Full and delta";
"Proxy-сервер" = "Proxy-server";
"Підключатися через proxy-сервер" = "Connect using proxy-server";
"Автентифікуватися на proxy-сервері" = "Authenticate on proxy-server";
"Зберегти пароль" = "Save password";
"TSP-сервер ЦСК" = "CA TSP-server";
"Отримувати позначки часу" = "Get timestamps";
"OCSP-сервер ЦСК" = "CA OCSP-server";
"Використовувати OCSP-сервер" = "Use OCSP-server";
"Перевіряти до перевірки у файловому сховищі" = "Check before file store";
"Використовувати точки доступу до OCSP-серверів" = "Use access points to OCSP-servers";
"сервера..." = "server...";
"користувача..." = "user...";
"Назва ЦСК" = "CA common name";
"Точка доступу (URI)" = "Access point (URI)";
"LDAP-сервер ЦСК" = "CA LDAP-server";
"Використовувати LDAP-сервер" = "Use LDAP-server";
"Анонімний доступ" = "Anonimous access";
"CMP-сервер ЦСК" = "CA CMP-server";
"Використовувати CMP-сервер" = "Use CMP-server";
"Особистий ключ" = "Private key";
"з носія ключа на носій" = "from key media to key media";
"з носія ключа у файл" = "from key media to file";
"з файла на носій" = "from file to key media";
"Зареєстровані носії особистого ключа" = "Registered key medias";
"Сертифікати та СВС" = "Certificates and CRLs";
"Сертифікати та списки відкликаних сертифікатів" = "Certificates and certificates revocation lists";
"Реєстрація подій" = "Log events";
"Записувати події у системний журнал реєстрації" = "Write events to system registration journal";
"Відправляти інформацію про події агенту моніторингу" = "Send information about events to monitoring agent";
"DNS-ім'я чи IP-адреса агента" = "Agent DNS-name or IP-address";
"UDP-порт агента" = "Agent UDP-port";
"Реєструвати тільки події, що пов'язані з помилками" = "Log only error events";
"DNS-ім'я чи IP-адреса OCSP-сервера" = "OCSP-server DNS-name or IP-address";
"Встановіть носій ключової інформації чи підключіть криптографічний модуль та вкажіть параметри" = "Insert key media or plug in cryptomodule and enter parameters";
"Встановіть (за необхідністю) носій ключової інформації чи підключіть криптографічний модуль та вкажіть параметри" = "Insert (if needed) key media or plug in cryptomodule and enter parameters";
"Інформація про носій" = "Key media information";
"Апаратний криптомодуль" = "Hardware cryptomodule";
"Натиснуто <Caps Lock>" = "<Caps Lock> pressed";
"Попередньо відформатувати" = "Preformat";
"Повтор" = "Confirm";
"Новий пароль" = "New password";
"Повтор паролю" = "Confirm password";
"Генерація ключів" = "Keys generation";
"Міжнародні алгоритми" = "International algorithms";
"Запити на формування сертифікатів" = "Certificate requests";
"Генерацію ключів завершено" = "Keys generation finished";
"для державних алгоритмів і протоколів" = "for national algorithms and protocols";
"для міжнародних алгоритмів і протоколів" = "for international algotithms and protocols";
"для державних та міжнародних алгоритмів і протоколів" = "for national and international algotithms and protocols";
"Тип криптографічних алгоритмів та протоколів" = "Cryptographic algorithms and protocols type";
"Зберегти особистий ключ до файлу" = "Save private key to file";
"Ім’я файлу для збереження особистого ключа" = "Private key file name";
"Пароль доступу до особистого ключа" = "Private key password";
"ДСТУ 4145-2002 та Диффі-Гелман в гр. точок ЕК з ГОСТ 34311" = "DSTU 4145-2002 and Diffi-Hellman in group of points of an EC with GOST 34311";
"ДСТУ 4145-2002 та Диффі-Гелман в гр. точок ЕК з ДСТУ 7564" = "DSTU 4145-2002 and Diffi-Hellman in group of points of an EC with DSTU 7564";
"RSA" = "RSA";
"ECDSA" = "ECDSA";
"Використовувати окремий ключ для протоколу розподілу" = "Use separate key for key exchange protocol";
"Ключі ЕЦП" = "DS keys";
"з файлу параметрів" = "from params file";
"мінімальна (191 біт)" = "minimal (191 bit)";
"базова (257 біт)" = "base (257 bit)";
"велика (307 біт)" = "high (307 bit)";
"Ключі протоколу розподілу" = "Key exchange protocol keys";
"базова (257 біт)" = "base (257 bit)";
"велика (431 біт)" = "high (431 bit)";
"максимальна (571 біт)" = "max (571 bit)";
"Ключі" = "Keys";
"мінімальна (1024 біта з SHA-1)" = "minimal (1024 bit with SHA-1)";
"базова (2048 біт з SHA-256)" = "base (2048 bit with SHA-256)";
"велика (3072 біта з SHA-256)" = "high (3072 bit with SHA-256)";
"максимальна (4096 біт з SHA-256)" = "maximal (4096 bit with SHA-256)";
"мінімальна (NIST P-192 192 біта з SHA-1)" = "minimal (NIST P-192 192 bit with SHA-1)";
"базова (NIST P-256 256 біт з SHA-256)" = "base (NIST P-256 256 bit with SHA-256)";
"велика (NIST P-384 384 біта з SHA-384)" = "high (NIST P-384 384 bit with SHA-256)";
"максимальна (NIST P-521 521 біт з SHA-512)" = "maximal (NIST P-521 521 bit with SHA-256)";
"Місце розміщення параметрів (каталог, з'ємний чи оптичний диск)" = "Parameters location (directory, removable or optical disk";
"Ім'я файлу для запису запиту з відкритим ключем ЕЦП" = "Certificate request for DS public key file name";
"Ім'я файлу для запису запиту з відкритим ключем протоколу розподілу" = "Certificate request for KEP public key file name";
"Ім'я файлу для запису запиту з відкритим ключем RSA" = "Certificate request for RSA public key file name";
"Ім'я файлу для запису запиту з відкритим ключем ECDSA" = "Certificate request for ECDSA public key file name";
"ЦСК" = "CA";
"Дійсний" = "Valid";
"Реєстраційний номер" = "Registration number";
"Використання ключів" = "Key usage";
"Наступний сертифікат" = "Next certificate";
"Поля сертифіката" = "Certificate fields";
"Загальна інформація" = "General information";
"Час формування" = "Updates time";
"Призначення" = "Usage";
"Відкликаний сертифікат" = "Revoked certificate";
"Поля запиту" = "Request fields";
"Підписувач" = "Signer";
"Відправник" = "Sender";
"Посада" = "Position";
"Функціональне призначення" = "Functional purpose";
"Позначка часу" = "Time stamp";
"Час підпису" = "Signature time";
"Інформація про підписувача" = "Information about signer";
"Інформація про відправника" = "Information about sender";
"Організація та підрозділ" = "Organization and org. unit";
"Наступний підпис" = "Next sign";
"(%d з %d)" = "(%d from %d)";
"Поля інформації про ключ" = "Private key info fields";
"Інформації за данним питанням не знайдено" = "Information according to data issuer not found";
"Вимоги до надійного пароля" = "Requirements for secure password";
"Вимоги до надійного пароля захисту особистого ключа:\r\n  * довжина - не меньше 8 символів;\r\n  * не повинен містити однакові символи;\r\n  * не повинен містити підряд більше ніж 2 символи\r\n    з розкладинки клавіатури;\r\n  * дозволені символи - 'a-z', 'A-Z', '0-9', '+', '-'.\r\n" = "Requirements for secure password protection of private key:\r\n  * length - no less than 8 characters;\r\n  * must not contain the same characters;\r\n  * must not contain more than 2 consecutive characters\r\n    with keyboard layout; \r\n  * allowed characters - 'a-z', 'A-Z', '0-9', '+', '-'.\r\n";
"Б" = "B";
"КБ" = "KB";
"МБ" = "MB";
"ГБ" = "GB";
"ТБ" = "TB";
"Додати каталог" = "Add directory";
"Вкажіть ім'я каталогу" = "Enter directory name";
"Невірне ім'я файла" = "Invalid file name";
"Оберіть типи особистих ключів для експорту, а також вкажіть параметри експорту" = "Choose the types of personal keys for exports and specify export parameters";
"Експортувати у контейнер особистих ключів та сертифікатів" = "Export to private keys and certificates container";
"Експортувати у контейнери особистих ключів" = "Export to private keys containers";
"Експортувати сертифікати" = "Export certificates";
"Вкажіть облікові дані" = "Enter credentials";
"Вкажіть пароль доступу до контейнеру особистих ключів та сертифікатів" = "Enter password for container with private keys and certificates";
"Власник" = "Subject";
"Власник ключа" = "Key owner";
"Серійний номер" = "Serial number";
"Реквізити власника" = "Subject credentials";
"Реквізити ЦСК" = "Issuer credentials";
"РН" = "RN";
"РН сертифіката" = "Certificate RN";
"РН сертифіката відкр. ключа ЕЦП" = "DS certificate RN";
"РН сертифіката відкр. ключа прот. розподілу" = "KEP certificate RN";
"РН сертифіката відкр. ключа RSA" = "RSA certificate RN";
"РН сертифіката відкр. ключа ECDSA" = "ECDSA certificate RN";
"Додаткові дані власника" = "Additional subject info";
"Адреса" = "Address";
"Телефон" = "Phone";
"DNS-ім'я чи інше технічного засобу" = "DNS-name or other for device";
"Адреса електронної пошти" = "EMail";
"Код ЄДРПОУ" = "EDRPOU code";
"Код ДРФО" = "DRFO code";
"Ідентифікатор НБУ" = "NBU ID";
"Код СПФМ" = "SPFM code";
"Код організації" = "Organization code";
"Код підрозділу" = "Organization unit code";
"Код користувача" = "User code";
"УНЗР" = "UNZR";
"UPN-ім'я" = "UPN";
"Строк чинності сертифіката" = "Certificate validity";
"Сертифікат чинний з" = "Certificate valid from";
"Сертифікат чинний до" = "Certificate valid to";
"Строк дії особистого ключа" = "Private key validity";
"Час введення в дію ос. ключа" = "Private key begin time";
"Час виведення з дії ос. ключа" = "Private key end time";
"Параметри відкритого ключа" = "Public key parameters";
"Тип ключа" = "Key type";
"Довжина ключа" = "Key length";
"Відкритий ключ" = "Public key";
"Модуль" = "Module";
"Експонента" = "Exponent";
"Ідентифікатор відкритого ключа" = "Public key ID";
"Ідентифікатор ключа" = "Key ID";
"Уточнене призначення ключів" = "Extended key usage";
"Правила сертифікації" = "Certification policies";
"Тип власника" = "Basic contraints";
"Тип власника" = "Subject type";
"Обмеження на довжину ланцюжка" = "Chain length";
"Інф. про точки доступу до СВС ЦСК" = "CRL distribution points info";
"Точка доступу до повних СВС ЦСК" = "Full CRL distribution point";
"Точка доступу до часткових СВС ЦСК" = "Partial CRL distribution point";
"Інф. про точки доступу до серверів ЦСК" = "CA servers access points info";
"Точка доступу до OCSP-сервера" = "OCSP-server access point";
"Точка доступу до сертифікатів" = "Certificates access point";
"Точка доступу до TSP-сервера" = "TSP-server access point";
"Ід. відкр. ключа ЕЦП ЦСК" = "Issuer DS public key ID";
"ід. відкр. ключа ЦСК" = "CA public key ID";
"Ід. відкр. ключа власника" = "Subject public key ID";
"Тип НКІ" = "KM type";
"Максимальне обмеження на транзакцію" = "Max limit for transaction";
"ДСТУ 4145-2002" = "DSTU 4145-2002";
"RSA" = "RSA";
"ECDSA" = "ECDSA";
"Невідомий" = "Unknown";
"%d біт(а)" = "%d bit";
"Додаткові дані власника відсутні" = "No additional subject info";
"Строк чинності сертифіката відсутній" = "No certificate validity";
"Строк дії особистого ключа відсутній" = "No private key validity";
"Уточнене призначення ключів відсутнє" = "No extended key usage";
"Правила сертифікації не визначені" = "No certification policies";
"Тип власника не визначений" = "No subject type";
"Не ЦСК" = "Not CA";
"Інф. про точки доступу до СВС ЦСК відсутня" = "No CRL distribution points info";
"Інф. про точки доступу до серверів ЦСК відсутня" = "No CA servers access points info";
"Захищений" = "Qualified signature creation device";
"Посилений" = "Power";
"з %@ до %@" = "from %@ to %@";
"%@ у державних алгоритмах і протоколах" = "%@ in national algoritms and protocols";
"%@ у міжнародних алгоритмах і протоколах" = "%@ in international algoritms and protocols";
"ЕЦП" = "DS";
"Неспростовність" = "Repudation";
"Шифрування ключів" = "Encryption data";
"Шифрування даних" = "Encryption data";
"Протоколи розподілу ключів" = "Key agreement";
"Підпис сертифікатів" = "Certificates sign";
"Підпис СВС" = "CRL sign";
"Сервер ЦСК" = "CA server";
"CMP-сервер" = "CMP-server";
"TSP-сервер" = "TSP-server";
"OCSP-сервер" = "OCSP-server";
"DVCS-сервер" = "DVCS-server";
"Адміністратор реєстрації" = "Registration administrator";
"Користувач ЦСК" = "CA user";
"сервер ЦСК" = "CA server";
"адміністратор реєстрації" = "Registration administrator";
"користувач ЦСК" = "CA user";
"Формування позначок часу" = "Make timestamps";
"Підпис OCSP-відповідей" = "Sign OCSP-replies";
"Підпис DVCS-відповідей" = "Sign DVCS-replies";
"Обробка CMP-повідомлень" = "Handle CMP-messages";
"Сервер безпеки" = "Security server";
"Сервер" = "Server";
"Цифрова печатка" = "Digital stamp";
"SSL-cервер" = "SSL server";
"SSL-клієнт" = "SSL client";
"Автентифікація за смарт-картою" = "Smartcard authentication";
"Правила посиленої сертифікації" = "Qualified certification rules";
"Час формування" = "Creation time";
"Час наступного формування" = "Next creation time";
"Наступний" = "Next";
"Час наступного формування відсутній" = "No next creation time";
"Тип підпису" = "Signature type";
"Час" = "Time";
"Причина" = "Reason";
"Ідентифікатор відкритого ключа ЕЦП ЦСК" = "CA DS public key ID";
"Для використання у державних алгоритмах і протоколах" = "For usage in national algoritms and protocols";
"Для використання у міжнародних алгоритмах і протоколах" = "for usage in international algoritms and protocols";
"РН відсутній" = "No RN";
"Ідентифікатор відкритого ключа ЕЦП ЦСК відсутний" = "No CA DS public key ID";
"РН повного СВС" = "Full CRL RN";
"Не визначена" = "Unknown";
"Компрометація ос. ключа ЦСК" = "CA priv. key compromise";
"Компрометація ос. ключа" = "Priv. key compromise";
"Зміна даних про власника" = "Subject data change";
"Завершений строк чинності" = "Expired";
"Формування нового" = "New issuered";
"Відсутня" = "No";
"Реквізити заявника" = "Applicant credentials";
"Додаткові дані" = "Additional data";
"Тип заявника" = "Applicant type";
"Дані про підпис запита" = "Request signature data";
"Реквізити ЦСК заявника" = "Applicant CA credentials";
"РН сертифіката заявника" = "Applicant certificate RN";
"Запит на формування сертифіката з відкритим ключем ЕЦП та протоколу розподілу" = "Certificate request with public key for DS and key exchange protocol";
"Запит на формування сертифіката з відкритим ключем ЕЦП" = "Certificate request with public key for DS";
"Запит на формування сертифіката з відкритим ключем протоколу розподілу" = "Certificate request with public key for exchange protocol";
"Запит на формування сертифіката з відкритим ключем RSA" = "Certificate request with RSA public key";
"Запит на формування сертифіката з відкритим ключем ECDSA" = "Certificate request with ECDSA public key";
"Параметри відкритого ключа" = "Public key parameters";
"Параметри відкритого ключа ЕЦП та протоколу розподілу" = "DS and key exchange protocol public key parameters";
"Параметри відкритого ключа ЕЦП" = "DS public key parameters";
"Параметри відкритого ключа протоколу розподілу" = "Key exchange protocol public key parameters";
"Реквізити заявника відсутні" = "No applicant credentials";
"Додаткові дані відсутні" = "No additional data";
"Не вказаний" = "Not specified";
"Запит самопідписаний" = "Self signed request";
"Інформація про зміну статусу" = "Change status information";
"Тип зміни" = "Change type";
"Причина зміни (скасування)" = "Change (revocation) reason";
"Ідентифікатор відкритого ключа ЕЦП" = "DS public key ID";
"Дані про сертифікат" = "Certificate information";
"Дані про запитувача" = "Requestor information";
"Реквізити ЦСК запитувача" = "Requestor CA credentials";
"РН сертифіката запитувача" = "Requestor certificate RN";
"Ревізити власника відсутні" = "No owner credentials";
"Дані про сертифікат відсутні" = "No certificate information";
"Запит не підписано" = "Request not signed";
"Відсутній" = "None";
"Скасування" = "Revoke";
"Блокування" = "Hold";
"Поновлення" = "Restore";
"П.І.Б." = "Full name";
"Організація" = "Oraganization";
"Підрозділ" = "Organization unit";
"Область" = "State";
"Населений пункт" = "Locality";
"Інформація про сертифікат підписувача" = "Signer certificate info";
"Інформація про сертифікат відправника" = "Sender certificate info";
"Інформація про час підпису відсутня" = "No signature time";
"Позначка часу відсутня" = "No timestamp";
"Інформація відсутня" = "No information";
"Підпис відсутній" = "No signature";
"Параметри особистих ключів" = "Private keys parameters";
"Державний алгоритм ЕЦП" = "National DS algorithm";
"Протокол розподілу ключів" = "Key exchange protocol";
"Міжнародний алгоритм" = "International algorithm";
"Д-Г в гр. точок ЕК" = "D-H in gr. of points of an EC";
"Розміщення ключа" = "Key location";
"Довжина ключа" = "Key length";
"Носій" = "Carrier";
"Криптомодуль" = "Cryptomodule";
"файлова система" = "file system";
"файлова система (каталоги системи)" = "file system (system directories)";
"файлова система (каталоги користувача)" = "file system (user directories)";
"Перезаписуємий" = "Rewritable";
"Неперезаписуємий" = "Not rewritable";
"Потребує автентифікації" = "Requires authentication";
"Не потребує автентифікації" = "Not require authentication";
"Тільки повна очистка" = "Only full cleaning";
"Електронний ключ" = "Electronic key";
"Смарт-карта" = "Smart-card";
"Криптомодуль" = "Cryptomodule";
"Мережевий криптомодуль" = "Network cryptomodule";
"Апаратний ГВП" = "Hardware RSG";
"Пароль занадто короткий (меньше 8 символів)" = "Password is too small (smaller then 8 characters)";
"Пароль занадто довгий (більше 42 символів)" = "Password is too long (longer then 42 characters)";
"Пароль містить однакові символи" = "Password contains the same characters";
"Пароль містить підряд більше ніж 2 символи з розкладинки клавіатури" = "Password contains more than 2 consecutive characters from keyboard";
"Пароль містить недозволені символи (дозволені - 'a-z', 'A-Z', '0-9', '+', '-')" = "Password contains illegal characters (allowed - 'a-z', 'A-Z', '0-9', '+', '-')";
"Стан виконання" = "Process state";
"Завантаження СВС з web-сервера ЦСК" = "Downloading CRL from CA web-server";
"Зчитування файлового сховища" = "Read file storage";
"Підключення до OCSP-сервера" = "Connecting to OCSP-server";
"Підключення до LDAP-сервера" = "Connecting to LDAP-server";
"Визначення переліку носіїв ключової інформації" = "Updating key media devices list";
"Зчитування особистого ключа" = "Reading private key";
"Зчитування особистого ключа з носія ключової інформації" = "Reading private key from key media";
"Перевірка носія ключової інформації" = "Checking private key media";
"Запис особистого ключа на носій ключової інформації" = "Writting private key to key media";
"Знищення особистого ключа на носієві ключової інформації" = "Destroying private key at key media";
"Зміна пароля захисту особистого ключа на носієві ключової інформації" = "Changing private key password at key media";
"Зчитування файлів з сертифікатами та СВС" = "Reading files with certificates and CRLs";
"Зчитування сертифікатів з файлового сховища" = "Reading certificates from file storage";
"Увімкнений режим off-line (без взаємодії з ЦСК)" = "Offline mode is on (without interaction with CA)";
"Виникла помилка при зчитуванні параметрів proxy-сервера з системного реєстру" = "An error occurred while reading proxy-server parameters from system registry";
"Підключення до web-сервера через proxy-сервер відмінене" = "Connection to web-server using proxy-server was canceled";
"Виникла помилка при автентифікації на proxy-сервері" = "An error occurred while authentication on proxy-server";
"Автоматичне завантаження СВС відключене" = "Auto download CRL is disabled";
"У сертифікаті не знайдено точок доступу до СВС за протоколом HTTP" = "CRL distributed points for access via HTTP not found in certificate";
"Виникла помилка при завантаженні СВС з web-сервера" = "An error occurred while downloading CRL from web-server";
"Виникла помилка при записі завантаженого СВС у файл" = "An error occurred while saving downloaded CRL to file";
"Пошук сертифіката у LDAP-каталозі" = "Certificate search in LDAP-directory";
"Виникла помилка при зчитуванні параметрів LDAP-сервера з системного реєстру" = "An error occurred while reading LDAP-server parameters from system registry";
"Не виконувався" = "Not performed";
"Бібліотека доступу до LDAP-сервера не ініціалізована" = "LDAP-server access library is not initialized";
"LDAP-cервер відключений" = "LDAP-server is down";
"Виникла помилка при підключенні до LDAP-серверу" = "An error occurred while connecting LDAP-server";
"Вказаного сертифіката нема у LDAP-каталозі" = "Selected certificate is not in the LDAP-directory";
"Виникла помилка при пошуку сертифіката у LDAP-каталозі" = "An error occurred while searching certificate in LDAP-directory";
"Виникла помилка при розборі сертифіката з LDAP-каталогу" = "An error occurred while parsing certficate from LDAP-directory";
"Сертифікат знайдено" = "Certificate was found";
"Пошук чи перевірка сертифіката через OCSP-сервер" = "Get or check certificate using OCSP-server";
"Пошук чи перевірка сертифікатів через OCSP-сервер" = "Get or check certificates using OCSP-server";
"Перевірка сертифіката за відповіддю із статусом сертифіката з підписаних даних" = "Check certificate by response with certificate status from signed data";
"Виникла помилка при зчитуванні параметрів OCSP-сервера з системного реєстру" = "An error occurred while reading OCSP-server parameters from register";
"Пошук чи перевірка сертифіката через OCSP-сервер з DNS-ім'ям чи ІР-адресою" = "Get or check certificate using OCSP-server with DNS-name or IP-address";
"Пошук чи перевірка сертифікатів через OCSP-сервер з DNS-ім'ям чи ІР-адресою" = "Get or check certificates using OCSP-server with DNS-name or IP-address";
"Пошук чи перевірка сертифіката відкр. ключа ЕЦП через OCSP-сервер з DNS-ім'ям чи ІР-адресою" = "Get or check public key certificate for DS using OCSP-server with DNS-name or IP-address";
"Пошук чи перевірка сертифіката відкр. ключа прот. розподілу через OCSP-сервер з DNS-ім'ям чи ІР-адресою" = "Get or check public key certificate for KEP using OCSP-server with DNS-name or IP-address";
"Виникла помилка при формуванні запиту на визначення статусу сертифіката" = "An error occurred while making request for certificate status";
"Виникла помилка при формуванні запиту на визначення статусу сертифікатів" = "An error occurred while making request for certificates status";
"Підключення до OCSP-сервера через proxy-сервер відмінене" = "Connection to OCSP-server through proxy is canceled";
"Виникла помилка при обміні даними з OCSP-сервером" = "An error occurred while communicating with OCSP-server";
"Виникла помилка при розборі відповіді із статусом сертифіката" = "An error occurred while parsing reply with certificate status";
"Виникла помилка при розборі відповіді із статусом сертифікатів" = "An error occurred while parsing reply with certificates status";
"Виникла помилка при обробці запита OCSP-сервером" = "An error occurred while OSCP-server processing request";
"Виникла помилка при пошуку сертифіката OCSP-сервера" = "An error occurred while searching OCSP-server certificate";
"Виникла помилка при пошуку сертифіката OCSP-сервера у файловому сховищі" = "An error occurred while searching OCSP-server certificate in file store";
"Виникла помилка при розборі сертифіката OCSP-сервера" = "An error occurred while parsing OCSP-server certificate";
"Сертифікат OCSP-сервера скасований чи заблокований або виникла помилка при його пошуку та перевірці у файловому сховищі" = "OCSP-server certificate is canceled or blocked or an error occurred while searching it in file store";
"Сертифікат, яким підписано відповідь із статусом сертифіката не є сертифікатом OCSP-сервера" = "Certificate that used for sign reply with certificate status is not OCSP-server certificate";
"Виникла помилка при перевірці відповіді із статусом сертифіката" = "An error occurred while checking reply with certificate status";
"Виникла помилка при перевірці відповіді із статусом сертифікатів" = "An error occurred while checking reply with certificates status";
"Виникла помилка при розборі відповіді із статусом сертифіката або сертифікат не знайдено" = "An error occurred while parsing reply with certificate status or certificate not found";
"Cертифікат не знайдено OCSP-сервером" = "Certificate not found by OCSP-server";
"Виникла помилка при розборі сертифіката у відповіді OCSP-сервера" = "An error occurred while parsing certificate in OCSP-server reply";
"Виникла помилка при перевірці відповідності отриманого сертифіката з відповіді OCSP-сервера" = "An error occurred while checking compliances received certificate from OCSP-server reply";
"Отриманий сертифікат у відповіді OCSP-сервера не співпадає з сертифікатом, статус якого визначався" = "Received certificate from OCSP-server reply not match with certificate, which status was determined";
"Сертифікат був чинний на момент використання (станом на %@)" = "Certificate was valid when it was used (at %@)";
"Сертифікат був не чинний на момент використання (станом на %@)" = "Certificate was not valid when it was used (at %@)";
"Тип зміни статусу сертифіката: %@. Причина: %@. Час зміни: %@" = "Certificate change status type: %@. Reason: %@. Change time: %@";
"Сертифікат не чинний " = "Certificate is not valid";
"Сертифікат чинний" = "Certificate is valid";
"Сертифікати чинні" = "Certificates is valid";
"Один з сертифікатів у ланцюжку не знайдено" = "One of the certificates in the chain not found";
"ЕЦП одного з сертифікатів у ланцюжку не вірний" = "DS of one certificate in the chain is invalid";
"Один з сертифікатів у ланцюжку відсутній у посиланнях на сертифікати підписаних даних" = "One of the certificates in the chain not found in signed data certificates references";
"Виникла помилка при підтвердженні статусу сертифіката. Сертифікат з файлового сховища не співпадає з сертифікатом із підписаних даних" = "An error occurred while confirming the status of the certificate. The certificate on file storage does not match the certificate in signed data";
"Виникла помилка при підтвердженні статусу сертифіката. Сертифікат з файлового сховища відсутній у посиланнях на сертифікати підписаних даних" = "An error occurred while confirming the status of the certificate. The certificate in file storage does not found in the signed data certificates references";
"ЕЦП самопідписаного сертифіката видавця не вірний" = "DS of self-signed issuer certificate is invalid";
"Самопідписаний сертифікат видавця не знайдено" = "Issuer self-signed certificate not found";
"Перевірка сертифіката у файловому сховищі" = "Certificate check in file storage";
"Перевірка сертифікатів у файловому сховищі" = "Certificates check in file storage";
"Пошук сертифіката у файловому сховищі" = "Certificate search in file storage";
"Пошук сертифікатів у файловому сховищі" = "Certificates search in file storage";
"Виникла помилка при розборі знайденого сертифіката" = "An error occurred while parsing certificate that was found";
"Виникла помилка при зчитуванні параметрів файлового сховища з системного реєстру" = "An error occurred while reading parameters of file storage from system registry";
"Сертифікати не зчитані з файлового сховища" = "Certificates are not read from the file storage";
"Виникла помилка при розборі одного з сертифікатів у ланцюжку" = "An error occurred while parsing certificate in the chain";
"Строк дії одного з сертифікатів у ланцюжку ще не почався або вже закінчений" = "The validity of a certificate in the chain has not started or has already finished";
"Видавець сертифіката відкр. ключа ЕЦП не співпадає з видавцем сертифіката відкр. ключа прот. розподілу" = "Issuer of public key certificate for DS does not match the certificate issuer of public key certificate for KEP";
"Не знайдено жодного сертифіката" = "No certificates found";
"Один з сертифікатів у ланцюжку не співпадає з сертифікатом із підписаних даних" = "One of the certificates in the chain was not match with certificate from signed data";
"Сертифікат чинний (вже перевірявся)" = "Certicate is valid (already checked)";
"Сертифікати чинні (вже перевірялись)" = "Certificates are valid (already checked)";
"СВС не зчитані з файлового сховища" = "CRLs not read from file store";
"Не знайдено діючих СВС одного з ЦСК у ланцюжку" = "Valid CRL one of CA not found in chain";
"Виникла помилка при розборі одного з СВС у ланцюжку" = "An error occurred while while parsing one of CRL in the chain";
"ЕЦП одного з СВС у ланцюжку не вірний" = "DS of one crl in the chain is invalid";
"Виникла помилка при визначенні статусу сертифікатат за допомогою СВС у ланцюжку" = "An error occurred while determining the status of certificate using CRL in the chain";
"Один з сертифікатів у ланцюжку був не чинний на момент використання (знайдений у СВС станом на %@). Тип зміни статусу сертифіката: %@. Причина: %@" = "One of the certificates in the chain was not valid at the time of use (found in CRL at %@). Change type certificate status: %@. Reason: %@";
"Один з сертифікатів у ланцюжку не чинний (знайдений у СВС). Тип зміни статусу сертифіката: %@. Причина: %@" = "One of the certificates in the chain was not valid (found in CRL). Change type certificate status: %@. Reason: %@";
"Пошук чи визначення статусу сертифіката" = "Certificate search or check certificate status";
"Пошук чи визначення статусу сертифікатів" = "Certificates search or check certificates status";
"Пошук чи визначення статусу сертифіката не можливі" = "Certificate search or check certificate status is not possible";
"Пошук чи визначення статусу сертифікатів не можливі" = "Certificates search or check certificates status is not possible";
"Пошук сертифіката" = "Certificate search";
"Пошук сертифікатів" = "Certificates search";
"Перевірка та визначення статусу сертифіката" = "Verify certificate and get status";
"Перевірка та визначення статусу сертифікатів" = "Verify certificates and get status";
"Сертифікат пошкоджений чи має невірний формат" = "The certificate is corrupted or has an incorrect format";
"Сертифікат відкр. ключа прот. розподілу пошкоджений чи має невірний формат" = "KEP certificate corrupted or wrong format";
"Сертифікат відкр. ключа RSA пошкоджений чи має невірний формат" = "RSA certificate corrupted or wrong format";
"Сертифікат відкр. ключа ECDSA пошкоджений чи має невірний формат" = "ECDSA certificate corrupted or wrong format";
"Особистий ключ відповідний до сертифіката не діючий" = "The private key corresponding to certificate is invalid by time";
"Особистий ключ відповідний до сертифіката відкр. ключа прот. розподілу не діючий" = "The private KEP key corresponding to certificate is invalid by time";
"Особистий ключ відповідний до сертифіката відкр. ключа RSA не діючий" = "The private RSA key corresponding to certificate is invalid by time";
"Особистий ключ відповідний до сертифіката відкр. ключа ECDSA не діючий" = "The private ECDSA key corresponding to certificate is invalid by time";
"Сертифікат чинний (вже перевірявся)" = "Certificate valid (already verified)";
"Сертифікати чинні (вже перевірялись)" = "Certificates valid (already verified)";
"Сертифікат не чинний або його статус не визначений" = "Certificate invalid or status not determined";
"Сертифікати не чинні або їх статуси не визначені" = "Certificates invalid or status not determined";
"Сертифікат не чинний (за протоколом OCSP)" = "Certificate invalid (OCSP protocol)";
"Сертифікати не чинні (за протоколом OCSP)" = "Certificates invalid (OCSP protocol)";
"Сертифікат не чинний (знайдений у СВС)" = "Certificate invalid (found in CRL)";
"Сертифікати не чинні (знайдені у СВС)" = "Certificates invalid (found in CRL)";
"Сертифікат не знайдено" = "Certificate was not found";
"Сертифікати знайдено" = "Certificates was found";
"Сертифікат знайдено та перевірено" = "Certificate was found and verified";
"Сертифікати знайдено та перевірено" = "Certificates were found and verified";
"Статус сертифіката можливо визначений не вірно" = "Certificate status may have been incorrectly determined";
"Статус сертифікатів можливо визначений не вірно" = "Certificates status may have been incorrectly determined";
"Оберіть модуль зі списку" = "Select module from list";
"Модулі не зареєстровані" = "No registered modules";
"Інформація про модуль" = "Module information";
"Назва модуля" = "Module name";
"Серійний номер" = "Serial number";
"IP-адреса" = "IP-address";
"Маска IP-адреси" = "Network mask";
"Оберіть ім'я файла для збереження" = "Choose file name to save";
"Використати його?" = "Use it?";
"Використати їх?" = "Use them?";
"Експорт сертифіката" = "Export certificate";
"Експорт сертифікатів" = "Export certificates";
"Оберіть або створіть каталог для збереження сертификату" = "Choose or create directory to save certificate file";
"Оберіть або створіть каталог для збереження сертификатів" = "Choose or create directory to save certificates files";
"Імпорт сертифікатів" = "Import certificates";
"Оберіть сертификати для імпорту" = "Choose certificates to import";
"Видалити сертифікат?" = "Delete certificate?";
"Видалити сертифікати?" = "Delete certificates?";
"Імпорт списків відкликаних сертифікатів" = "Import certificate revocation lists";
"Оберіть СВС для імпорту" = "Choose CRLs to import";
"Видалити СВС?" = "Delete CRL?";
"Видалити СВС?" = "Delete CRLs?";
"Збереження запиту на формування сертифіката" = "Saving certificate request";
"Збереження запиту на формування сертифіката з відкритим ключем ЕЦП" = "Saving certificate request with public key for DS";
"Збереження запиту на формування сертифіката з відкритим ключем протоколу розподілу" = "Saving certificate request with public key for KEP";
"Збереження запиту на формування сертифіката з відкритим ключем RSA" = "Saving certificate request with RSA public key";
"Збереження запиту на формування сертифіката з відкритим ключем ECDSA" = "Saving certificate request with ECDSA public key";
"Каталог з файлами кріптографічних параметрів" = "Directory with cryptographic parameters files";
"Оберіть каталог з файлами кріптографічних параметрів" = "Choose directory with cryptographic parameters files";
"Збереження особистого ключа" = "Saving private key";
"Оберіть файл для збереження особистого ключа" = "Choose file for save private key";
"Оберіть файл з особистим ключем" = "Choose file for save private key";
"Оберіть каталог з сертифікатами та СВС" = "Choose directory with certificates and CRLs";
"Зберегти параметри роботи перед виходом?" = "Save parameters before close?";
"Виникла помилка при збереженні параметрів. Продовжити?" = "An error occurred while saving parameters. Continue, without saving?";
"Створити його?" = "Create it?";
"Продовжити?" = "Continue?";
"Видалити точку доступу до OCSP-сервера?" = "Remove OCSP-server access point from list?";
"Резервне копіювання ключа до файлу" = "Backup private key from key media to file";
"Резервне копіювання ключа на носій" = "Backup private key from file to key media";
"Файл з таким ім'ям вже існує. Перезаписати?" = "File already exists. Do you want to replace it?";
"Експорт ключа" = "Export key";
"Видалити модуль?" = "Delete module?";
"Повідомлення оператору" = "Message to operator";
"Виникла помилка при збереженні у файл" = "An error occurred while saving file";
"Виникла помилка при пошуку сертифіката" = "An error occurred while searching certificate";
"Виникла помилка при видаленні сертифіката" = "An error occurred while deleting certificate";
"Виникла помилка при зчитуванні сертифіката з файлу" = "An error occurred while reading certificate from file";
"Виникла помилка при записі сертифіката у файл" = "An error occurred while writting certificate to file";
"Виникла помилка при імпорті сертифіката у файлове сховище" = "An error occurred while importing certificate to file storage";
"Виникла помилка при експорті сертифіката" = "An error occurred while exporting certificate";
"Сертифікат відсутній" = "No certificate";
"строків чинності" = "validity";
"(реквізитів власника)" = "(subject credentials)";
"(реквізитів ЦСК)" = "(issuer credentials)";
"(ідентифікатора відкритого ключа ЦСК)" = "issuer public key identifier";
"(типу відкритого ключа)" = "(public key type)";
"(відкритих ключів)" = "(public keys)";
"(використання ключів)" = "(key usage)";
"Сертифікат не обрано" = "Certificate not selected";
"Не обрано жодного сертифіката" = "Any of certificates isn't selected";
"Не обрано жодного ключа" = "Any of keys isn't selected";
"Виникла помилка при зчитуванні СВС з файлу" = "An error occurred while reading CRL from file";
"Виникла помилка при імпорті СВС у файлове сховище" = "An error occurred while importing CRL to file store";
"Виникла помилка при видалені СВС" = "An error occurred while deleting CRL";
"Виникла помилка про пошуку СВС" = "An error occurred while searching CRL";
"Параметри роботи не знайдені або пошкоджені у системному реєстрі" = "Settings not found or corrupted";
"Всі параметри вcтановлені по замовчанню" = "All settings set to default values";
"Не вказане ім'я каталогу з сертифікатами та СВС" = "Certificate and CRLs directory name not specified";
"Каталог з сертифікатами та СВС не існує або немає доступу до нього" = "Certificate and CRLs directory does not exists or no access to it";
"Виникла помилка при створенні каталогу з сертифікатами та СВС" = "An error occurred while creating directory with certificate and CRLs";
"Не вказаний час зберігання стану перевіреного сертифіката" = "Certificate expire time not specified";
"Час зберігання стану перевіреного сертифіката має невірний формат (повинен бути в діапазоні від 1 до 86 400 с (1 доби))" = "Certificate expire time has imvalid format (must be in range 1 to 86 400 s (1 day)";
"Виникла помилка при зчитуванні файлового сховища" = "An error occurred while reading file storage";
"Не вказане DNS-ім'я або ІР-адреса proxy-сервера" = "Proxy-server DNS-name or IP-address is not specified";
"Не вказане DNS-ім'я або ІР-адреса TSP-сервера" = "TSP-server DNS-name or IP-address is not specified";
"Не вказане DNS-ім'я або ІР-адреса OCSP-сервера" = "OCSP-server DNS-name or IP-address is not specified";
"Не вказане DNS-ім'я або ІР-адреса CMP-сервера" = "CMP-server DNS-name or IP-address is not specified";
"Не вказане DNS-ім'я або ІР-адреса LDAP-сервера" = "LDAP-server DNS-name or IP-address is not specified";
"Не вказане DNS-ім'я або ІР-адреса агента моніторингу" = "Monitoring agent DNS-name or IP-address is not specified";
"Не вказано номер TCP-порта сервера" = "Server's TCP port not specified";
"Не вказаний номер TCP-порта proxy-сервера" = "Proxy-server TCP-port is not specified";
"Не вказаний номер TCP-порта TSP-сервера" = "TSP-server TCP-port is not specified";
"Не вказаний номер TCP-порта OCSP-сервера" = "OCSP-server TCP-port is not specified";
"Не вказаний номер TCP-порта CMP-сервера" = "CMP-server TCP-port is not specified";
"Не вказаний номер TCP-порта LDAP-сервера" = "LDAP-server TCP-port is not specified";
"Не вказаний номер UDP-порта агента моніторингу" = "MonitoringAgent UDP-port is not specified";
"Номер TCP-порта сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "Server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер TCP-порта proxy-сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "Proxy-server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер TCP-порта TSP-сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "TSP-server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер TCP-порта OCSP-сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "OCSP-server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер TCP-порта CMP-сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "CMP-server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер TCP-порта LDAP-сервера має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "LDAP-server TCP-port has invalid format (must be in range 1 to 65 535)";
"Номер UDP-порта агента моніторингу має невірний формат (повинен бути в діапазоні від 1 до 65 535)" = "MonitoringAgent UDP-port has invalid format (must be in range 1 to 65 535)";
"Не вказане ім'я користувача proxy-сервера" = "Proxy-server user name is not specified";
"Не вказане ім'я користувача LDAP-сервера" = "LDAP-server user name is not specified";
"Не вказаний пароль доступу до LDAP-сервера" = "LDAP-server password is not specified";
"Виникла помилка при записі параметрів файлового сховища у системний реєстр" = "An error occurred while writing file storage parameters to system registry";
"Виникла помилка при записі параметрів proxy-сервера у системний реєстр" = "An error occurred while writing proxy-server parameters to system registry";
"Виникла помилка при записі параметрів TSP-сервера у системний реєстр" = "An error occurred while writing TSP-server parameters to system registry";
"Виникла помилка при записі параметрів OCSP-сервера у системний реєстр" = "An error occurred while writing OCSP-server parameters to system registry";
"Виникла помилка при записі параметрів CMP-сервера у системний реєстр" = "An error occurred while writing CMP-server parameters to system registry";
"Виникла помилка при записі параметрів LDAP-сервера у системний реєстр" = "An error occurred while writing LDAP-server parameters to system registry";
"Виникла помилка при записі параметрів реєстрації подій у системний реєстр" = "An error occurred while writing log events parameters to system registry";
"Не вказано назву ЦСК" = "CA common name not specified";
"Не вказано точку доступу (URI-назву)" = "Access point (URI) not specified";
"Сертифікат не містить інформацію про точку доступу" = "No access point information in certificate";
"Виникла помилка при розборі сертифіката" = "An error occurred while parsing certificate";
"ЦСК з такою назвою вже є у списку" = "CA with this name is already exists in list";
"Не вказано жодної точки доступу до OCSP-серверів" = "OCSP access points is not specified";
"OCSP-сервер вже є у списку" = "OSCP-server already in the list";
"Резервне копіювання особистого ключа виконано успішно" = "Private key backuped successfully";
"Резервне копіювання особистого ключа з носія у файл виконано успішно" = "Private key from key media to file backuped successfully";
"Резервне копіювання особистого ключа з файлу на носій виконано успішно" = "Private key from file to key media backuped successfully";
"Знищення особистого ключа виконано успішно" = "Private key destroyed successfully";
"Зміна пароля захисту особистого ключа виконана успішно" = "Private key password changed successfully";
"Виникла помилка при розборі запиту на формування сертифіката" = "An error occurred while parsing certificate request";
"Виникла помилка при розборі інформації про особистий ключ" = "An error occurred while parsing private key information";
"Виникла помилка при розборі СВС" = "An error occurred while parsing CRL";
"Не обрано тип міжнародних криптографічних алгоритмів та протоколів" = "International cryptographic algorithms and protocols type not specified";
"Виникла помилка при зчитуванні файлу з особистим ключем" = "An error occurred while reading private key file";
"Виникла помилка при записі файлу з особистим ключем" = "An error occurred while saving file with private key";
"Виникла помилка при записі файлу з інформацією про особистий ключ" = "An error occurred while saving file with private key information";
"Виникла помилка при записі файлу з запитом на сертифікат" = "An error occurred while saving file with certificate request";
"Виникла помилка при записі запиту на формування сертифіката з відкритим ключем ЕЦП у файл" = "An error occurred while saving file with certificate request for DS public key";
"Виникла помилка при записі запиту на формування сертифіката з відкритим ключем протоколу розподілу у файл" = "An error occurred while saving file with certificate request for KEP public key";
"Виникла помилка при записі запиту на формування сертифіката з відкритим ключем RSA у файл" = "An error occurred while saving file with certificate request for RSA public key";
"Виникла помилка при записі запиту на формування сертифіката з відкритим ключем ECDSA у файл" = "An error occurred while saving file with certificate request for ECDSA public key";
"Не вказано файл для запису  особстого ключа" = "Private key file not specified";
"Не вказано пароль доступу до особстого ключа" = "Private key password not specified";
"Введений пароль доступу до особистого ключа не задовільняє вимогам" = "Private key password does not satisfy  requirements";
"Не вказано носій ключової інформації" = "Key media not specified";
"Не вказано користувача носія ключової інформації" = "Key media user not specified";
"Не вказано пароль доступу до носія ключової інформації" = "Key media password not specified";
"Не вказано повторно пароль доступу до носія ключової інформації" = "Key media confirmation password not specified";
"Пароль доступу до носія ключової інформації та його повтор не співпадають" = "Key media password and confirmation password did not match";
"Введений пароль доступу до носія ключової інформації не задовільняє вимогам" = "Key media password does not satisfy  requirements";
"Не вказано новий пароль доступу до носія ключової інформації" = "Key media new password not specified";
"Не вказано повторно новий пароль доступу до носія ключової інформації" = "Key media new password confirmation not specified";
"Новий пароль доступу до носія ключової інформації та його повтор не співпадають" = "Key media new password and confirmation password did not match";
"Новий пароль доступу до носія ключової інформації не задовільняє вимогам" = "Key media new password does not satisfy  requirements";
"Експорт особистого ключа з захищеного носія ключової інформації не можливий" = "Export private key from secure key media is not possible";
"Виникла помилка при отриманні ідентифікатора відкритого ключа" = "An error occurred while obtaining the public key identifier";
"Виникла помилка при формуванні контейнеру особистих ключів та сертифікатів" = "An error occurred while making container with private keys and certificates";
"Експорт ключів завершено успішно" = "Keys exported successfully";
"Виникла помилка при записі контейнеру особистого ключа у файл" = "An error occurred while saving container with private key to file";
"Виникла помилка при записі контейнеру особистих ключів та сертифікатів у файл" = "An error occurred while saving container with private keys and certificates to file";
"Каталог вже існує, будь ласка введіть інше ім'я" = "Directory exists, please enter other name";
"Невірне ім'я каталогу" = "Invalid directory name";
"Виникла помилка при створенні каталогу" = "An error occurred while creating directory";
"Всі поля повинні бути заповнені" = "All fields must be filled";
"Значення полів не співпадають" = "Field values are not equal";
"Не вказано ім'я користувача" = "User name is not specified";
"Не вказано пароль" = "Password is not specified";
"Не вказано підтвердження паролю" = "Password confirmation not specified";
"Пароль та його підтвердження не співпадають" = "Password and password confirmation did not match";
"Не вказано назву модуля" = "Module name is not specified";
"Не вказано серійний номер модуля" = "Module serial number is not specified";
"Не вказано ІР-адресу модуля" = "Module IP-address is not specified";
"Не вказано маску ІР-адреси модуля" = "Module network mask is not specified";
"ІР-адреса модуля має невірний формат" = "Module IP-address has invalid format";
"Маска ІР-адреси модуля має невірний формат" = "Module network mask has invalid format";
"Модуль із вказаною назвою вже зареєстрований" = "Module with specified name is already registered";
"Вказаний серійний номер вже має інший зареєстрований модуль" = "Module with specified serial number is already registered";
"Виникла помилка при додаванні модуля у системний реєстр" = "An error occurred while adding module to system registry";
"Виникла помилка при встановленні параметрів модуля у системному реєстрі" = "An error occurred while setting module parameters to system registry";
